erenerdemM/Ege_Eagle_Ultrasonik/STM32/Ultrasonik_G4_Master/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "system_state.h"
#include "esp32_uart.h"
#include "pt100_adc.h"
#include "heater_relay.h"
#include "ultrasonic_pwm.h"
#include "process_timer.h"
#include "x9c103s.h"
#include <stdio.h>  // HIL_DEEP_DEBUG: snprintf for the COM11 debug stream
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
static uint32_t last_status_tick_ms = 0;
static uint32_t last_hil_debug_tick_ms = 0;  // HIL_DEEP_DEBUG

/* Tank ID override storage: last 2KB page of 512KB flash (Bank 2, page 127),
 * clear of the application image. Layout: [0]=magic (uint32_t), [4]=id (uint32_t). */
#define TANK_ID_FLASH_ADDR  0x0807F800UL
#define TANK_ID_FLASH_PAGE  127U
#define TANK_ID_FLASH_BANK  FLASH_BANK_2
#define TANK_ID_MAGIC       0xA5A5A5A5UL

/* Bench test bypass: forces MY_TANK_ID to this value and skips Flash/DIP
 * reads entirely. Set to 0 to restore normal production boot logic. */
#define BENCH_DEV_MODE_ID 0  // 0 = Production boot logic (Flash Page 127 override -> DIP -> UNCOMMISSIONED)
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

OPAMP_HandleTypeDef hopamp3;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart3;
UART_HandleTypeDef hlpuart1;  // HIL_TEST_MOD: ST-Link VCP (COM11) debug/telemetry echo
IWDG_HandleTypeDef hiwdg;

/* USER CODE BEGIN PV */
/* This node's multi-drop bus address (1-10). Set at boot in main() from a
 * Flash override (TankId_Load) or, failing that, the DIP switch GPIOs. */
uint8_t MY_TANK_ID = 1;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_OPAMP3_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_LPUART1_UART_Init(void);  // HIL_TEST_MOD: ST-Link VCP (COM11) init
static void MX_IWDG_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* Reads the 4 DIP switch GPIOs (active-low, pull-up) into a 1..10 Tank ID.
 * All switches open (raw 0) defaults to ID 1; raw values above 10 are clamped. */
static uint8_t ReadDipSwitchId(void)
{
  uint8_t raw = 0U;
  if (HAL_GPIO_ReadPin(DIP_SW1_GPIO_Port, DIP_SW1_Pin) == GPIO_PIN_RESET) raw |= 0x01U;
  if (HAL_GPIO_ReadPin(DIP_SW2_GPIO_Port, DIP_SW2_Pin) == GPIO_PIN_RESET) raw |= 0x02U;
  if (HAL_GPIO_ReadPin(DIP_SW3_GPIO_Port, DIP_SW3_Pin) == GPIO_PIN_RESET) raw |= 0x04U;
  if (HAL_GPIO_ReadPin(DIP_SW4_GPIO_Port, DIP_SW4_Pin) == GPIO_PIN_RESET) raw |= 0x08U;

  if (raw == 0U) return 1U;
  if (raw > 10U) return 10U;
  return raw;
}

#define STAGING_TIMEOUT_MS  10000U
static uint32_t s_staging_start_tick = 0U;
static uint8_t  s_staging_active     = 0U;
static uint8_t  s_saved_tank_id      = 1U;
static ProvState_t s_saved_prov_state = PROV_STATE_UNCOMMISSIONED;

/* Returns the Flash-stored override ID (1..10), or 0 if no valid override is present. */
uint8_t TankId_Load(uint8_t *out_state)
{
  uint32_t magic          = *(volatile uint32_t *)(TANK_ID_FLASH_ADDR);
  uint32_t stored_payload = *(volatile uint32_t *)(TANK_ID_FLASH_ADDR + 4U);

  if (magic == TANK_ID_MAGIC)
  {
    uint8_t id    = (uint8_t)(stored_payload & 0xFFU);
    uint8_t state = (uint8_t)((stored_payload >> 8) & 0xFFU);

    if (id >= 1U && id <= 10U)
    {
      if (out_state != NULL)
      {
        *out_state = state;
      }
      return id;
    }
  }

  if (out_state != NULL)
  {
    *out_state = (uint8_t)PROV_STATE_UNCOMMISSIONED;
  }
  return 0U;
}

/* Writes Flash Bank 2 Page 127 (0x0807F800) with 0xA5A5A5A5 magic key and performs instant readback verification. */
uint8_t TankId_SaveAndVerifyOverride(uint8_t new_id, uint8_t state)
{
  if (new_id < 1U || new_id > 10U)
  {
    return 0U;
  }

  if (g_system_state.mode == SYS_MODE_RUNNING)
  {
    return 0U; /* Interlock: Never modify Flash while high-voltage PWM/heating is active */
  }

  FLASH_EraseInitTypeDef erase_init;
  uint32_t page_error = 0U;

  erase_init.TypeErase = FLASH_TYPEERASE_PAGES;
  erase_init.Banks     = TANK_ID_FLASH_BANK;
  erase_init.Page      = TANK_ID_FLASH_PAGE;
  erase_init.NbPages   = 1U;

  __disable_irq();
  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);

  if (HAL_FLASHEx_Erase(&erase_init, &page_error) != HAL_OK)
  {
    HAL_FLASH_Lock();
    __enable_irq();
    __DSB();
    return 0U;
  }

  uint32_t payload = ((uint32_t)state << 8) | (uint32_t)new_id;
  uint64_t data = ((uint64_t)payload << 32) | (uint64_t)TANK_ID_MAGIC;

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, TANK_ID_FLASH_ADDR, data) != HAL_OK)
  {
    HAL_FLASH_Lock();
    __enable_irq();
    __DSB();
    return 0U;
  }

  HAL_FLASH_Lock();
  __enable_irq();
  __DSB();

  /* Instant Readback Verification */
  uint32_t verify_magic   = *(volatile uint32_t *)(TANK_ID_FLASH_ADDR);
  uint32_t verify_payload = *(volatile uint32_t *)(TANK_ID_FLASH_ADDR + 4U);

  uint8_t readback_id    = (uint8_t)(verify_payload & 0xFFU);
  uint8_t readback_state = (uint8_t)((verify_payload >> 8) & 0xFFU);

  if (verify_magic == TANK_ID_MAGIC && readback_id == new_id && readback_state == state)
  {
    MY_TANK_ID = new_id;
    g_system_state.prov_state = (ProvState_t)state;
    return 1U;
  }

  return 0U;
}

/* Erases Flash Bank 2 Page 127, reverting Flash state to UNCOMMISSIONED */
uint8_t TankId_EraseOverride(void)
{
  if (g_system_state.mode == SYS_MODE_RUNNING)
  {
    return 0U;
  }

  FLASH_EraseInitTypeDef erase_init;
  uint32_t page_error = 0U;

  erase_init.TypeErase = FLASH_TYPEERASE_PAGES;
  erase_init.Banks     = TANK_ID_FLASH_BANK;
  erase_init.Page      = TANK_ID_FLASH_PAGE;
  erase_init.NbPages   = 1U;

  __disable_irq();
  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);

  if (HAL_FLASHEx_Erase(&erase_init, &page_error) != HAL_OK)
  {
    HAL_FLASH_Lock();
    __enable_irq();
    __DSB();
    return 0U;
  }

  HAL_FLASH_Lock();
  __enable_irq();
  __DSB();

  MY_TANK_ID = 0U;
  g_system_state.prov_state = PROV_STATE_UNCOMMISSIONED;
  return 1U;
}

/* Volatile RAM Staging logic: updates RAM state to ID=0 STAGING without erasing/writing Flash,
 * initiating non-blocking 10,000 ms auto-timeout rollback timer. */
void TankId_StartStaging(void)
{
  if (s_staging_active)
  {
    /* Already staging: refresh tick timer only, do NOT overwrite s_saved_tank_id */
    s_staging_start_tick = HAL_GetTick();
    return;
  }

