erenerdemM/Ege_Eagle_Ultrasonik/STM32/Ultrasonik_G4_Master/Core/Src/main.c
  s_saved_tank_id = MY_TANK_ID;
  s_saved_prov_state = g_system_state.prov_state;

  MY_TANK_ID = 0U;
  g_system_state.prov_state = PROV_STATE_STAGING;

  s_staging_start_tick = HAL_GetTick();
  s_staging_active = 1U;
}

void TankId_ProcessStagingTimeout(void)
{
  if (s_staging_active)
  {
    if ((HAL_GetTick() - s_staging_start_tick) >= STAGING_TIMEOUT_MS)
    {
      MY_TANK_ID = s_saved_tank_id;
      g_system_state.prov_state = s_saved_prov_state;
      s_staging_active = 0U;

      const char *log_msg = "LOG:STAGING_TIMEOUT_ROLLBACK\n";
      HAL_UART_Transmit(&huart3, (const uint8_t *)log_msg, (uint16_t)strlen(log_msg), 10);
      HAL_UART_Transmit(&hlpuart1, (const uint8_t *)log_msg, (uint16_t)strlen(log_msg), 10);
    }
  }
}

void TankId_CancelStaging(void)
{
  if (s_staging_active)
  {
    MY_TANK_ID = s_saved_tank_id;
    g_system_state.prov_state = s_saved_prov_state;
    s_staging_active = 0U;
  }
}

void TankId_ConfirmStaging(uint8_t final_id)
{
  if (s_staging_active)
  {
    s_staging_active = 0U;
  }
  (void)TankId_SaveAndVerifyOverride(final_id, (uint8_t)PROV_STATE_ACTIVE);
}

/* ====================================================================
 * BENCH TEST DIAGNOSTIC API
 * ==================================================================== */

uint8_t HeaterTest_Readback(void)
{
  uint8_t expected = HAL_GPIO_ReadPin(HEATER_RELAY_GPIO_Port, HEATER_RELAY_Pin) == GPIO_PIN_SET ? 1 : 0;
  uint8_t actual = HAL_GPIO_ReadPin(HEATER_TEST_FB_GPIO_Port, HEATER_TEST_FB_Pin) == GPIO_PIN_SET ? 1 : 0;
  return (expected == actual) ? 1 : 0;
}

uint8_t TriacTest_Readback(void)
{
  uint8_t expected = HAL_GPIO_ReadPin(TRIAC_GATE_GPIO_Port, TRIAC_GATE_Pin) == GPIO_PIN_SET ? 1 : 0;
  uint8_t actual = HAL_GPIO_ReadPin(TRIAC_TEST_FB_GPIO_Port, TRIAC_TEST_FB_Pin) == GPIO_PIN_SET ? 1 : 0;
  return (expected == actual) ? 1 : 0;
}

static void BenchTest_Process(void)
{
  static uint32_t last_diagnostic_tick = 0;
  if ((HAL_GetTick() - last_diagnostic_tick) >= 1000u)
  {
    last_diagnostic_tick = HAL_GetTick();
    if (!HeaterTest_Readback())
    {
      char msg[] = "DIAGNOSTIC: HEATER_FEEDBACK_MISMATCH\r\n";
      HAL_UART_Transmit(&hlpuart1, (uint8_t *)msg, sizeof(msg) - 1, 10);
    }
    if (!TriacTest_Readback())
    {
      char msg[] = "DIAGNOSTIC: TRIAC_FEEDBACK_MISMATCH\r\n";
      HAL_UART_Transmit(&hlpuart1, (uint8_t *)msg, sizeof(msg) - 1, 10);
    }
  }
}

/* HIL_DEEP_DEBUG: white-box internals, printed only from the main superloop (never an ISR)
 * onto the ST-Link VCP (COM11) so the HIL test host can verify internal MCU math/logic
 * (raw ADC counts, triac firing delay, relay bit) that the STAT telegram never exposes. */
static void HIL_DeepDebug_Print(void)
{
  char buf[128];
  int len = snprintf(buf, sizeof(buf), "DEBUG_STM: ADC=%lu, DELAY=%lu, RELAY=%u, HEATER_OUT=%u, HEATER_FB=%u, TRIAC_OUT=%u, TRIAC_FB=%u\r\n",
                      (unsigned long)PT100_ADC_GetLastRaw(),
                      (unsigned long)UltrasonicPWM_GetCurrentDelayUs(),
                      (unsigned int)g_system_state.relay_state,
                      (unsigned int)(HAL_GPIO_ReadPin(HEATER_RELAY_GPIO_Port, HEATER_RELAY_Pin) == GPIO_PIN_SET ? 1 : 0),
                      (unsigned int)(HAL_GPIO_ReadPin(HEATER_TEST_FB_GPIO_Port, HEATER_TEST_FB_Pin) == GPIO_PIN_SET ? 1 : 0),
                      (unsigned int)(HAL_GPIO_ReadPin(TRIAC_GATE_GPIO_Port, TRIAC_GATE_Pin) == GPIO_PIN_SET ? 1 : 0),
                      (unsigned int)(HAL_GPIO_ReadPin(TRIAC_TEST_FB_GPIO_Port, TRIAC_TEST_FB_Pin) == GPIO_PIN_SET ? 1 : 0));
  if (len > 0)
  {
    HAL_UART_Transmit(&hlpuart1, (uint8_t *)buf, (uint16_t)len, 10);
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_OPAMP3_Init();
  MX_TIM1_Init();
  MX_USART3_UART_Init();
  MX_LPUART1_UART_Init();  // HIL_TEST_MOD: ST-Link VCP (COM11) for HIL test observability
  MX_IWDG_Init();          // 1000 ms Hardware IWDG initialization

  /* USER CODE BEGIN 2 */

  SystemState_Init();

#if (BENCH_DEV_MODE_ID > 0)
  /* Bench dev mode: fixed ID override for single-node desktop testing */
  MY_TANK_ID = BENCH_DEV_MODE_ID;
  g_system_state.prov_state = PROV_STATE_ACTIVE;
#else
  /* Production Boot Rule: Flash Page 127 override determines commissioning identity */
  {
    uint8_t init_state = (uint8_t)PROV_STATE_UNCOMMISSIONED;
    uint8_t override_id = TankId_Load(&init_state);
    if (override_id >= 1U && override_id <= 10U && init_state == (uint8_t)PROV_STATE_ACTIVE)
    {
      MY_TANK_ID = override_id;
      g_system_state.prov_state = PROV_STATE_ACTIVE;
    }
    else
    {
      /* Uncommissioned node: MUST boot at MY_TANK_ID = 0, PROV_STATE_UNCOMMISSIONED */
      MY_TANK_ID = 0U;
      g_system_state.prov_state = PROV_STATE_UNCOMMISSIONED;
    }
  }
#endif

  /* Check if reset was caused by Hardware IWDG timeout */
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != RESET)
  {
    __HAL_RCC_CLEAR_RESET_FLAGS();
    SystemState_SafeStop(STOP_REASON_WATCHDOG_RESET);
  }

  ESP32_UART_Init();
  PT100_ADC_Init();
  HeaterRelay_Init();
  UltrasonicPWM_Init();
  ProcessTimer_Init();
  X9C103S_Init();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    ESP32_UART_Process();
    PT100_ADC_Process();
    HeaterRelay_Process();
    UltrasonicPWM_Process();
    ProcessTimer_Process();

    /* Check auto-timeout for volatile RAM staging rollback */
    TankId_ProcessStagingTimeout();

    /* Non-blocking 500 ms telemetry heartbeat to the ESP32 (HAL_GetTick(),
     * never blocks the superloop) */
    if ((HAL_GetTick() - last_status_tick_ms) >= 500u)
    {
      last_status_tick_ms = HAL_GetTick();
      ESP32_UART_SendStatus();
    }

    /* HIL_DEEP_DEBUG: independent non-blocking 500 ms white-box stream on COM11 */
    if ((HAL_GetTick() - last_hil_debug_tick_ms) >= 500u)
    {
      last_hil_debug_tick_ms = HAL_GetTick();
      HIL_DeepDebug_Print();
    }

    BenchTest_Process();

